# вычисление двоичного логического сдвига второго числа влево на число разрядов, равное первому
# вход: a b, итог: a b результат

# встать на первый бит a
q0, ,>,q1

# копирование a
# текущий исходный бит временно стирается и восстанавливается
q1,0, ,q2
q1,1, ,q9
q1, ,>,q17
q2, ,>,q3
q3,0,>,q3
q3,1,>,q3
q3, ,>,q4
q4,0,>,q4
q4,1,>,q4
q4, ,>,q5
q5,0,>,q5
q5,1,>,q5
q5, ,0,q6
q6,0,<,q6
q6,1,<,q6
q6, ,<,q7
q7,0,<,q7
q7,1,<,q7
q7, ,<,q8
q8,0,<,q8
q8,1,<,q8
q8, ,0,q16
q9, ,>,q10
q10,0,>,q10
q10,1,>,q10
q10, ,>,q11
q11,0,>,q11
q11,1,>,q11
q11, ,>,q12
q12,0,>,q12
q12,1,>,q12
q12, ,1,q13
q13,0,<,q13
q13,1,<,q13
q13, ,<,q14
q14,0,<,q14
q14,1,<,q14
q14, ,<,q15
q15,0,<,q15
q15,1,<,q15
q15, ,1,q16
q16,0,>,q1
q16,1,>,q1

# копирование b
# перед вычислениями лента содержит a b a b
q17,0, ,q18
q17,1, ,q25
q17, ,>,q33
q18, ,>,q19
q19,0,>,q19
q19,1,>,q19
q19, ,>,q20
q20,0,>,q20
q20,1,>,q20
q20, ,>,q21
q21,0,>,q21
q21,1,>,q21
q21, ,0,q22
q22,0,<,q22
q22,1,<,q22
q22, ,<,q23
q23,0,<,q23
q23,1,<,q23
q23, ,<,q24
q24,0,<,q24
q24,1,<,q24
q24, ,0,q32
q25, ,>,q26
q26,0,>,q26
q26,1,>,q26
q26, ,>,q27
q27,0,>,q27
q27,1,>,q27
q27, ,>,q28
q28,0,>,q28
q28,1,>,q28
q28, ,1,q29
q29,0,<,q29
q29,1,<,q29
q29, ,<,q30
q30,0,<,q30
q30,1,<,q30
q30, ,<,q31
q31,0,<,q31
q31,1,<,q31
q31, ,1,q32
q32,0,>,q17
q32,1,>,q17

# проверка рабочего счетчика и вычитание 1
q33,0,>,q33
q33,1,>,q34
q33, ,<,q50
q34,0,>,q34
q34,1,>,q34
q34, ,<,q35
q35,0,1,q36
q36,1,<,q35
q35,1,0,q37
q37,0,>,q37
q37,1,>,q37
q37, ,>,q38

# один логический сдвиг влево
# первый бит убрать, остальные перенести влево, справа записать 0
q38,0, ,q39
q38,1, ,q39
q39, ,>,q40
q40,0, ,q41
q40,1, ,q43
q40, ,<,q46
q41, ,<,q42
q42, ,0,q45
q43, ,<,q44
q44, ,1,q45
q45,0,>,q39
q45,1,>,q39
q46, ,0,q47

# если слово нулевое, перейти к очистке
# иначе вернуться к счетчику
q47,0,<,q47
q47,1,<,q48
q47, ,<,q50
q48,0,<,q48
q48,1,<,q48
q48, ,<,q49
q49,0,<,q49
q49,1,<,q49
q49, ,>,q33

# удалить рабочий счетчик, перенося ответ целиком влево
q50,0, ,q51
q50,1, ,q51
q50, ,>,q61
q51, ,>,q52
q52, ,>,q53
q53,0, ,q54
q53,1, ,q56
q53, ,<,q59
q54, ,<,q55
q55, ,0,q58
q56, ,<,q57
q57, ,1,q58
q58,0,>,q52
q58,1,>,q52
q59, ,<,q60
q60,0,<,q60
q60,1,<,q60
q60, ,<,q50

# последний перенос ответа влево
# между исходным вводом и ответом остается один пробел
q61, ,>,q62
q62,0, ,q63
q62,1, ,q65
q63, ,<,q64
q64, ,0,q67
q65, ,<,q66
q66, ,1,q67
q67,0,>,q61
q67,1,>,q61

# встать на первую пустую клетку сразу после результата
# остановиться с сохранением состояния
q62, ,<,q69
q69, ,s,q69
