// Решите поставленную задачу в формате четвёрок
00, ,<,ql
ql,1,<,ql
ql,0,<,ql
ql, ,>,q0
q0,1,a,q1
q0,0,a,q6
q0, ,>,qs1
q1,a,>,q1
q1,1,>,q1
q1,0,>,q1
q1, ,>,q2
q2,1,>,q2
q2,0,>,q2
q2, ,1,q3
q3,1,<,q3
q3,0,<,q3
q3, ,<,q4
q4,1,<,q4
q4,0,<,q4
q4,a,1,q5
q5,1,>,q0
q5,0,>,q0
q6,a,>,q6
q6,1,>,q6
q6,0,>,q6
q6, ,>,q7
q7,1,>,q7
q7,0,>,q7
q7, ,0,q8
q8,1,<,q8
q8,0,<,q8
q8, ,<,q9
q9,1,<,q9
q9,0,<,q9
q9,a,0,q5
qs1,1,>,qs1
qs1,0,>,qs1
qs1, ,<,q10
q10, ,>,fin
q10,0,<,q11
q10,1,<,q16
q11, ,>,fin
q11,0,<,q10
q11,1,0,q12
q12,0,>,q13
q13,0,1,q14
q14,1,<,q15
q15,0,<,q10
q16, ,>,fin
q16,1,<,q10
q16,0,1,q17
q17,1,>,q18
q18,1,0,q19
q19,0,<,q20
q20,1,<,q10
fin,1,>,fin
fin,0,>,fin
fin, ,#,fin
