// Решите поставленную задачу в формате четвёрок
// Задача: зеркально отразить цифры двоичного числа относительно его середины


// Начало работы программы


// блок программы копирование числа

0, ,@,0 //обнаружение пустого символа и замена его на вспомогательный @
0,@,<,1
1,1,<,1 //видим 0 перескакиваем вперед
1,@,<,1
1,0,<,1 //видим 0 перескакиваем вперед
1, ,>,2 //видим пустоту и перескакиваем обратно к символу
1,X,>,2
1,Y,>,2
2,1,X,3 //замена 1 на x
2,0,Y,3 //замена 0 на y

2,@,<,2
2,X,=,8 // переход к работе с х для замены обратно
2,Y,=,8 // переход к работе с у для замены обратно

3,X,>,4 //переход после замены на движения относительно х
3,Y,>,5 //переход после замены на движения относительно у
4,0,>,4 //перемещение вправо, если x
4,1,>,4 //перемещение вправо, если x
4, ,=,6
6, ,1,1 // работа после перешагивания вспом.символа
6,1,>,6
6,0,>,6
4,@,>,6 //перемещение курсора за вспомогательный символ
5,0,>,5 //перемещение вправо, если y
5,1,>,5 //перемещение вправо, если y
5,@,>,7
7, ,0,1
7,1,>,7
7,0,>,7

8,X,1,8 //замена х на 1 при обратном проходе
8,1,<,8
8,Y,0,8 //замена у на 0 при обратном проходе
8,0,<,8
8, ,=,9
9, ,>,9
9,0,>,9
9,1,>,9
9,@, ,10 // замена вспомогательного символа после копирования числа

// конец блока копирование числа



// начало блока отрезкаливание числа

10, ,>,11 //блок команд для начала нового алгоритма с зеркаливанием числа

11,1,X,12 // считали 1, запомнили, оставив маркер x
11,0,Y,13 // считали 0, запомнили, оставив маркер y


11, ,@,241 // переход к блоку склеивания числа


12,X,>,120 // шаг от маркера x, чтобы начать движение вправо
120,1,>,120 // бежим до конца числа, неся в памяти единицу
120,0,>,120 // бежим до конца числа, неся в памяти единицу
120, ,=,14 // дошли до пустоты в конце - записываем 1

13,Y,>,130 // шаг от маркера y, чтобы начать движение вправо
130,1,>,130 // бежим до конца числа, неся в памяти ноль
130,0,>,130 // бежим до конца числа, неся в памяти ноль
130, ,=,15 // дошли до пустоты в конце - записываем 0

14,@,<,14
14, ,1,160 // записали перебегающую 1
15,@,<,15
15, ,0,160 // записали перебегающий 0


16,1, ,17 // считали справа 1, удалили её, переход в состояние перетаскивания 1
16,0, ,18 // считали справа 0, удалили его, переход в состояние перетаскивания 0
160,1,<,16 // сдвинулись от перенесенной 1
160,0,<,16 // сдвинулись от перенесенного 0

16,X, ,11 // удаляем вспомогательный маркер, так как у него нет парной цифры
16,Y, ,11 // удаляем вспомогательный маркер, так как у него нет парной цифры

17, ,<,21 // сделали шаг от удаленного символа

18, ,<,19 // сделали шаг от удаленного символа
19,1,<,19 // бежим влево через оставшиеся цифры
19,0,<,19
19,X,0,20 // нашли маркер X - возвращаем вместо него 0 (стадия отзеркаливания)
19,Y,0,20 // нашли маркер Y - возвращаем вместо него 0 (стадия отзеркаливания)
20,0,>,11 // восстановили цифру, сдвинулись оратно для нового цикла

21,1,<,21 // бежим влево через оставшиеся цифры
21,0,<,21

21,X,1,22 // нашли маркер X - возвращаем вместо него 1 (стадия отзеркаливания)
21,Y,1,22 // нашли маркер Y - возвращаем вместо него 1 (стадия отзеркаливания)
22,1,>,11 // восстановили цифру, сдвинулись оратно для нового цикла

// после того как остается пробел, надо сдвинуть правую часть числа чтобы она соединилась с левой


// блок склейки итогового числа

241,@,>,24

24, ,<,270 // работа с пробелами и доп.символами во время склейки числа
270,@, ,270
270, ,#,270

24,0, ,25 // увидела 0, удалила и перешла в состояние для перемешения
24,1, ,26 // увидела 1, удалила и перешла в состояние для перемешения

25, ,@,25 // блок для переноса 0
25,@,<,250
250,@,0,250
250,0,>,241

26, ,@,26 // блок для переноса 1
26,@,<,260
260,@,1,260
260,1,>,241

// конец блока склейки итогового числа

// конец блока отрезкаливание числа


// Конец работы программы
