// Генерация двух чисел из четных и нечетных разрядов двоичного числа.
// Позиции считаются слева направо, начиная с 1.

q0,0,>,q0
q0,1,>,q0
q0, ,|,q1
q1,0,<,q1
q1,1,<,q1
q1,|,<,q1
q1, ,>,q2
q2,0,A,q3
q2,1,C,q4
q2,|,>,q9
q3,0,>,q3
q3,1,>,q3
q3,x,>,q3
q3,y,>,q3
q3,a,>,q3
q3,b,>,q3
q3,|,>,q3
q3,A,>,q3
q3,B,>,q3
q3, ,0,q5
q4,0,>,q4
q4,1,>,q4
q4,x,>,q4
q4,y,>,q4
q4,a,>,q4
q4,b,>,q4
q4,|,>,q4
q4,C,>,q4
q4,D,>,q4
q4, ,1,q5
q5,0,<,q5
q5,1,<,q5
q5,x,<,q5
q5,y,<,q5
q5,a,<,q5
q5,b,<,q5
q5,|,<,q5
q5,A,x,q6
q5,C,y,q6
q5,B,x,q12
q5,D,y,q12
q6,x,>,q7
q6,y,>,q7
q7,0,a,q8
q7,1,b,q8
q7,|,>,q9
q8,a,>,q2
q8,b,>,q2
q9,0,>,q9
q9,1,>,q9
q9, ,|,q10
q10,0,<,q10
q10,1,<,q10
q10,x,<,q10
q10,y,<,q10
q10,a,<,q10
q10,b,<,q10
q10,|,<,q10
q10, ,>,q11
q11,x,>,q11
q11,y,>,q11
q11,a,B,q3
q11,b,D,q4
q11,|, ,q13
q12,x,>,q11
q12,y,>,q11
q13, ,<,q14
q14,x,0,q16
q14,y,1,q16
q14, ,>,q15
q15,0,>,q15
q15,1,>,q15
q15, ,>,q17
q16,0,<,q14
q16,1,<,q14
q17,0,>,q17
q17,1,>,q17
q17,|, ,q18
q18, ,#,q18
